## Melt를 사용하지 않는 경우

In [29]:
import pandas as pd

a = ['Fruit','apple','banana','kiwi','orange']
b = ['vegie','Lettuce','onion']
c = ['metal','gold','silver','iron']

a = pd.DataFrame(a[1:], columns =[a[0]])
b = pd.DataFrame(b[1:], columns =[b[0]])
c = pd.DataFrame(c[1:], columns =[c[0]])

In [30]:
total = pd.concat([a,b,c], axis=1)

In [34]:
total

    Fruit    vegie   metal
0   apple  Lettuce    gold
1  banana    onion  silver
2    kiwi      NaN    iron
3  orange      NaN     NaN

In [37]:
raw = total.T

In [38]:
raw

             0       1     2       3
Fruit    apple  banana  kiwi  orange
vegie  Lettuce   onion   NaN     NaN
metal     gold  silver  iron     NaN

In [49]:
raw.T

    Fruit    vegie   metal
0   apple  Lettuce    gold
1  banana    onion  silver
2    kiwi      NaN    iron
3  orange      NaN     NaN

In [62]:
tk =[]
tk2 =[]
for i in range(3):
    tk.append([raw.T.columns[i]] * len(raw.T[raw.T.columns[i]]))
    tk2.append(list(raw.T[raw.T.columns[i]]))
col1 = pd.DataFrame([y for x in tk for y in x],columns=['A'])
col2 = pd.DataFrame([y for x in tk2 for y in x],columns=['B'])

col3 = pd.concat([col1,col2],axis=1)

In [66]:
print(tk)
print(tk2)
print(col1)
print(col2)
print(col3)

[['Fruit', 'Fruit', 'Fruit', 'Fruit'], ['vegie', 'vegie', 'vegie', 'vegie'], ['metal', 'metal', 'metal', 'metal']]
[['apple', 'banana', 'kiwi', 'orange'], ['Lettuce', 'onion', nan, nan], ['gold', 'silver', 'iron', nan]]
        A
0   Fruit
1   Fruit
2   Fruit
3   Fruit
4   vegie
5   vegie
6   vegie
7   vegie
8   metal
9   metal
10  metal
11  metal
          B
0     apple
1    banana
2      kiwi
3    orange
4   Lettuce
5     onion
6       NaN
7       NaN
8      gold
9    silver
10     iron
11      NaN
        A        B
0   Fruit    apple
1   Fruit   banana
2   Fruit     kiwi
3   Fruit   orange
4   vegie  Lettuce
5   vegie    onion
6   vegie      NaN
7   vegie      NaN
8   metal     gold
9   metal   silver
10  metal     iron
11  metal      NaN

In [67]:
col3.dropna(axis=0)

        A        B
0   Fruit    apple
1   Fruit   banana
2   Fruit     kiwi
3   Fruit   orange
4   vegie  Lettuce
5   vegie    onion
8   metal     gold
9   metal   silver
10  metal     iron

## Melt 사용하면?

In [73]:
total.melt().dropna(axis=0)

   variable    value
0     Fruit    apple
1     Fruit   banana
2     Fruit     kiwi
3     Fruit   orange
4     vegie  Lettuce
5     vegie    onion
8     metal     gold
9     metal   silver
10    metal     iron